rapport-2023-05-12.tex
% Created 2023-05-10 mer 16:43
% Intended LaTeX compiler: pdflatex

% =================================BASE====================================%
\documentclass[10pt]{article}
\usepackage[left=2cm,right=2cm,top=2cm,bottom=2cm]{geometry} % Marges
%\usepackage{libertine}
%\usepackage{libertinust1math}
\usepackage[T1]{fontenc} % Nécessaire avec FrenchBabel
\usepackage[utf8]{inputenc} % Important pour symboles Francophones, é,à,etc

\usepackage{lmodern}
\renewcommand{\familydefault}{cmr} % La meilleure police (CMU Serif Roman) (Je me suis battu).

\usepackage{natbib} % Bibliographie
\bibliographystyle{abbrvnat}



\usepackage{amsmath, amssymb, amsthm} % Symb. math. (Mathmode+Textmode) + Beaux théorèmes.

\usepackage{mathtools,cancel} % Utilisation de boîtes \boxed{} + \cancelto{}{}
\usepackage{graphicx, wrapfig} % Géstion des figures.
\usepackage{hyperref} % Permettre l'utilisation d'hyperliens.
\usepackage{color} % Permettre l'utilisation des couleurs.
\usepackage[dvipsnames]{xcolor} % Couleurs avancées.
\usepackage{titling} % Donne accès à \theauthor, \thetitle, \thedate

% >>> Physique >>>
\usepackage{physics} % Meilleur package pour physicien. 
\usepackage{pxfonts} % Rajoute PLEIN de symboles mathématiques, dont les intégrales doubles et triples
% <<< Physique <<<

\usepackage{lipsum} % For fun
\usepackage{tikz} % Realisation de figures TIKZ.
\usepackage{empheq} % Boite autour de MULTIPLE équations

\usepackage[french]{babel} % Environnements en Français.
% ==============================BASE-(END)=================================%



% ================================SETTINGS=================================%
% Pas d'indentation en début de paragraphe :
\setlength\parindent{0pt} 

% Couleurs de hyperliens :
\definecolor{mypink}{RGB}{147, 0, 255}
\hypersetup{colorlinks, urlcolor=mypink, citecolor=mypink, linkcolor=mypink}

% Numéros d'équations suivent les sections :
\numberwithin{equation}{section} 

% Les « captions » sont en italique et largeur limitée
\usepackage[textfont = it]{caption} 
\captionsetup[wrapfigure]{margin=0.5cm}


% Retirer le l'écriture en gras dans la table des matières
\usepackage{tocloft}
\renewcommand{\cftsecfont}{\normalfont}
\renewcommand{\cftsecpagefont}{\normalfont}

% Change bullet style
\usepackage{pifont}
\usepackage{enumitem}
\setlist[itemize,1]{label=\ding{224}}
% ================================SETTINGS=================================%



% ==============================NEWCOMMANDS================================%
% Degrés Celsius :
\newcommand{\celsius}{${}^\circ$ C} % \degrée Celsius : Pas mal plus simple qu'utilise le package gensymb qui plante avec tout...

% Vecteurs de base :
\newcommand{\nvf}{\vb{\hat{n}}}
\newcommand{\ivf}{\vb{\hat{i}}}
\newcommand{\jvf}{\vb{\hat{j}}}
\newcommand{\kvf}{\vb{\hat{k}}}

\newcommand{\uu}{\vb*{u}}

% Boîte vide pour ajuster les underbrace
\newcommand{\bigno}{\vphantom{\qty(\frac{d}{q})}}
\newcommand{\pt}{\hspace{1pt}}

% Moyenne numérique entre deux points de grilles. 
\newcommand{\xmean}[1]{\overline{#1}^x}
\newcommand{\ymean}[1]{\overline{#1}^y}

% Tilde over psi
\newcommand{\tpsi}{\tilde{\psi}}
% ==============================NEWCOMMANDS================================%



% ==============================PAGE-TITRE=================================%
% Titlepage 
\newcommand{\mytitlepage}{
\begin{titlepage}
\begin{center}
{\Large Contrat Été 2023 \par}
\vspace{2cm}
{\Large \MakeUppercase{\thetitle} \par}
\vspace{2cm}
RÉALISÉ DANS LE CADRE\\ D'UN PROJET POUR \par
\vspace{2cm}
{\Large ISMER--UQAR \par}
\vspace{2cm}
{\thedate}
\end{center}
\vfill
Rédaction \\
{\theauthor}\\
\url{charles-edouard.lizotte@uqar.ca}\\
ISMER-UQAR
\end{titlepage}
}
% ==============================PAGE-TITRE=================================%



% =================================ENTÊTE==================================%
\usepackage{fancyhdr}
\pagestyle{fancy}
\setlength{\headheight}{13pt}
\renewcommand{\headrulewidth}{1.3pt} % Ligne horizontale en haut

\fancyhead[R]{\textit{\thetitle}}
\fancyhead[L]{\ \thepage}
\fancyfoot[R]{\textit{\theauthor}}
\fancyfoot[L]{}
\fancyfoot[C]{} 
% =================================ENTÊTE==================================%
\author{Charles-Édouard Lizotte}
\date{12/05/2023}
\title{Carnet de bord, Université McGill}
\hypersetup{
 pdfauthor={Charles-Édouard Lizotte},
 pdftitle={Carnet de bord, Université McGill},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6.5)}, 
 pdflang={French}}
\begin{document}

\mytitlepage
\tableofcontents\newpage

\section{Nouvelle formulation pour le gradient de pression}
\label{sec:org7d38319}

David nous a éclairé de sa lumière mardi à 21h43 et nous est arrivé avec un solution super simple mais efficace.
En premier lieu, on se souvient qu'on définit notre pas de temps \emph{leapfrog} de manière à ce que
\begin{equation}
 \uu^{t+1} = \underbrace{ \uu^{t-1} + (2\Delta t)\cdot \vb*{G}^t}_{\tilde{\uu}} + \gradient{\phi}.
\end{equation}

On peut décomposer notre courant en deux composantes, soit barotrope et baroclines, de sorte à retrouver
\begin{subequations}
\begin{align}
 & \tilde{\uu}_{BT} = \frac{1}{H} \sum_k^n d_k \tilde{\uu}_k, \\
 & \tilde{\uu}_{BC} = \tilde{\uu} - \tilde{\uu}_{BT}.
\end{align}
\end{subequations}

Puis à l'aide de ce courant barotrope, on peut construire une vorticité barotrope
\begin{equation}
 \tilde{\zeta}_{BT} = \kvf \cdot \qty[\curl{\tilde{\uu}_{BT}}].
\end{equation}

Mais on peut aussi calculer la vorticité de notre futur courant, de sorte à retrouver
\begin{align}
& \zeta^{t+1}_{BT} = \kvf \cdot \qty[\curl{\uu^{t+1}_{BT}}],\bigno\nonumber\\
& \zeta^{t+1}_{BT} = \kvf \cdot \qty[\curl{\tilde{\uu}_{BT} + \gradient{\phi}}],\bigno\nonumber\\
& \zeta^{t+1}_{BT} = \kvf \cdot \qty[\curl{\tilde{\uu}_{BT}}] + \cancelto{0}{\kvf\cdot\qty[\curl{\gradient{\phi}}]}.
\end{align}
Comme le rotationnel d'un gradient est toujours nul, on arrive à la conclusion inévitable que
\begin{equation}
 \zeta^{t+1}_{BT} = \tilde{\zeta}_{BT}.
\end{equation}
La correspondance entre la vorticité relative est donnée par \(\zeta = \laplacian{\psi}\), donc on obtient une nouvelle équation de Poisson donnée par
\begin{equation}
\boxed{\hspace{0.3cm}
 \laplacian{\psi_{BT}} = \kvf \cdot \qty[\curl{\tilde{\uu}_{BT}}]
 \hspace{0.31cm}\text{avec C.F. Dirichlet}\hspace{0.31cm}
 \eval{\psi_{BT}\pt}_{x_0,\pt x_f} = \ \eval{\psi_{BT}\pt}_{y_0,\pt y_f} = 0,
\hspace{0.3cm} }
\end{equation}
et en trouvant \(\psi_{BT}\) on trouve \(\uu_{BT}\). \bigskip

Finalement, on retrouve
\begin{equation}
 \uu^{t+1} = \uu_{BT} + \uu_{BC},
\end{equation}
où \(\uu_{BC} = \tilde{\uu}_{BC}\) car \(\gradient{\phi}\) est une composante barotrope.

\subsection{Avantages}
\label{sec:org38fbddc}
Cette méthode a l'avantage de ramener le problème directement aux frontières, tout en oubliant complétement la composante de pression à trouver.

\section{Bibliographie}
\label{sec:org911efac}
\end{document}